# FamilySizeTableErrorInfo Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilySizeTableErrorInfo Properties
FamilySizeTableErrorInfo Class See Also
---
The FamilySizeTableErrorInfo type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FamilySizeTableErrorType | The error type. |
| FilePath | The path of the imported CSV file. |
| InvalidColumnIndex | The index of the invalid column. |
| InvalidHeaderText | The invalid header text. |
| InvalidRowIndex | The index of the invalid row. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
FamilySizeTableErrorInfo Class
Autodesk.Revit.DB Namespace